app/controllers/buyers_controller.rb

  def index
    @buyers = Buyer.all
---
SELECT "buyers".* FROM "buyers"

  def create
    @buyer = Buyer.new(buyer_params)

    respond_to do |format|
      if @buyer.save
---
INSERT INTO "buyers" ("address", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["address", "MyText"], ["created_at", "2018-08-05 02:51:45.172094"], ["name", "MyString"], ["updated_at", "2018-08-05 02:51:45.172094"]]

  def destroy
    @buyer.destroy
---
DELETE FROM "buyers" WHERE "buyers"."id" = ?  [["id", 980190962]]

    def set_buyer
      @buyer = Buyer.find(params[:id])
---
SELECT  "buyers".* FROM "buyers"  WHERE "buyers"."id" = ? LIMIT 1  [["id", 980190962]]