app/controllers/sales_controller.rb

SELECT "sales".* FROM "sales"
---
  def index
    @sales = Sale.all

INSERT INTO "sales" ("amount", "buyer_id", "created_at", "file", "price", "product_id", "supplier_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @sale = Sale.new(sale_params)
    flash_notice="This message will persist"
    respond_to do |format|
      if @sale.save

DELETE FROM "sales" WHERE "sales"."id" = ?  [["id", 980190962]]
---
  def destroy
    @sale.destroy

SELECT "sales".* FROM "sales"  WHERE "sales"."file" = 'dados.txt'
SELECT SUM(price * amount) AS sum_id FROM "sales"  WHERE "sales"."file" = 'dados.txt'
---
  def import
    if params[:file_upload].present?
      Sale.import(params[:file_upload])
      total = Sale.where(file: params[:file_upload].original_filename).sum("price * amount")

SELECT  "sales".* FROM "sales"  WHERE "sales"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_sale
      @sale = Sale.find(params[:id])